app/controllers/movies_controller.rb

  def index
	if params[:sort] != nil
		session[:sort] = params[:sort]
	end
	@sort=session[:sort]
	logger.debug @sort

	if params[:ratings] != nil
		session[:ratings] = params[:ratings]
	end
	@rating=session[:ratings]

	if(@rating == nil)
		if(@sort == nil)
			@sort='id'
		end
		@movies = Movie.order(@sort)
	else
		@movies = Movie.where(rating: @rating.keys).order(@sort)
---
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') ORDER BY release_date